driver-tests/bpelse/assign/AssignJbi/test/echoDurationDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoDurationDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoDurationDataType">
    <string>P1Y2M6DT14H25M13S</string>
    <normalizedString>P1Y2M6DT14H25M13S</normalizedString>
    <token>P1Y2M6DT14H25M13S</token>
    <base64Binary>P1Y2M6DT14H25M13S</base64Binary>
    <hexBinary>P1Y2M6DT14H25M13S</hexBinary>
    <integer>P1Y2M6DT14H25M13S</integer>
    <positiveInteger>P1Y2M6DT14H25M13S</positiveInteger>
    <negativeInteger>P1Y2M6DT14H25M13S</negativeInteger>
    <nonNegativeInteger>P1Y2M6DT14H25M13S</nonNegativeInteger>
    <nonPositiveInteger>P1Y2M6DT14H25M13S</nonPositiveInteger>
    <long>P1Y2M6DT14H25M13S</long>
    <unsignedLong>P1Y2M6DT14H25M13S</unsignedLong>
    <int>P1Y2M6DT14H25M13S</int>
    <unsignedInt>P1Y2M6DT14H25M13S</unsignedInt>
    <short>P1Y2M6DT14H25M13S</short>
    <unsignedShort>P1Y2M6DT14H25M13S</unsignedShort>
    <byte>P1Y2M6DT14H25M13S</byte>
    <unsignedByte>P1Y2M6DT14H25M13S</unsignedByte>
    <decimal>P1Y2M6DT14H25M13S</decimal>
    <float>P1Y2M6DT14H25M13S</float>
    <double>P1Y2M6DT14H25M13S</double>
    <boolean>P1Y2M6DT14H25M13S</boolean>
    <duration>P1Y2M6DT14H25M13S</duration>
    <dateTime>P1Y2M6DT14H25M13S</dateTime>
    <date>P1Y2M6DT14H25M13S</date>
    <time>P1Y2M6DT14H25M13S</time>
    <gYear>P1Y2M6DT14H25M13S</gYear>
    <gYearMonth>P1Y2M6DT14H25M13S</gYearMonth>
    <gMonth>P1Y2M6DT14H25M13S</gMonth>
    <gMonthDay>P1Y2M6DT14H25M13S</gMonthDay>
    <gDay>P1Y2M6DT14H25M13S</gDay>
    <Name>P1Y2M6DT14H25M13S</Name>
    <QName>P1Y2M6DT14H25M13S</QName>
    <NCName>P1Y2M6DT14H25M13S</NCName>
    <anyURI>P1Y2M6DT14H25M13S</anyURI>
    <language>P1Y2M6DT14H25M13S</language>
    <ID>P1Y2M6DT14H25M13S</ID>
    <IDREF>P1Y2M6DT14H25M13S</IDREF>
    <IDREFS>P1Y2M6DT14H25M13S</IDREFS>
    <ENTITY>P1Y2M6DT14H25M13S</ENTITY>
    <ENTITIES>P1Y2M6DT14H25M13S</ENTITIES>
    <NMTOKEN>P1Y2M6DT14H25M13S</NMTOKEN>
    <NMTOKENS>P1Y2M6DT14H25M13S</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
